# ---------------------------------- #
# Constants for command messages
# ---------------------------------- #
from sabpabot.handlers.handlers import HANDLERS

START_COMMAND_MESSAGE = 'سلام! به سامانه‌ی برنامه‌ریزی پی‌آر (سبپا) خوش اومدی. برای دریافت لیست کامندها دستور /help ' \
                        'رو اجرا کن. چی کار می‌تونم برات بکنم؟'

HELP_COMMAND_MESSAGE = 'سلام! به سامانه ی برنامه ریزی پی‌آر خوش اومدی. ما هنوز به گیت‌هاب وصل نیستیم و این بات صرفا ' \
                       'برای برنامه‌ریزی بهتر پی‌آرهامون ساخته شده. این لیست کامندها و نحوه‌ی استفاده ازشونه:\n\n'
for handler in HANDLERS:
    HELP_COMMAND_MESSAGE += f'کامند /{handler["command_name"]}: {handler["help_text"]}\n\n'
    HELP_COMMAND_MESSAGE += f'sample: {handler["usage_sample"]}\n----------\n'

# ---------------------------------- #
# Constants for command versioning
# ---------------------------------- #

VERSIONING_MESSAGES = {
    '2.0.0': {
        'message': (
            'سلام. ورژن 2.0.0 سبپا بات با تغییرات زیر در دسترسه:\n\n'
            '۱- حذف دستور /team. از این به بعد برای دریافت اطلاعات تمام تیم‌ها به هر شکلی از دستور /teams استفاده کنید.\n\n'
            '۲- دستور /teams با فلگ‌های جدید -t و -m در دسترسه. با فلگ -t می‌تونی مشخصات یک تیم خاص رو بپرسی و با فلگ -m'
            'می‌تونی تیم‌هایی که یه فرد خاص عضوشه رو ببینی. بدون این فلگ‌ها، لیست تمام تیم‌ها رو می‌بینی.\n\n'
            '۳- دستور /prs با کلی فلگ جدید اومده تا هر نوع فیلتری رو بتونی روی پی‌آرها اعمال کنی. بدون فلگ خاصی این '
            'دستور پی‌آرهای تموم نشده رو فقط نشون میده ولی با فلگ -f می‌تونی پی‌آرهای تموم‌شده رو ببینی. همینطور با'
            'فلگ‌های [-o, -r, -t, -s, -p] به ترتیب پی‌آرهای ساخته‌شده توسط خودت، با یک ریویوئر خاص، متعلق به یک گروه خاص، '
            'دارای یک وضعیت اورژانسی خاص، یا یک شماره پی‌آر خاص رو ببین.\n\n'
            '۴- دستور /accept حذف شده تا پیغام‌های کمتری توی گروه رد و بدل بشه. از این به بعد هر پی‌آری به فردی داده بشه '
            'جز ریویوهاش به حساب میاد و توی حجم کاری‌ش هم حساب میشه. با منشن کردن یک آی‌دی خاص می‌تونین به اعضای پرمشغله '
            'یا اعضای تیم‌های ایزوله هم پی‌آر بدین. در صورتی که از کی‌ورد random استفاده کنین به هیچ کاربر پرمشغله یا عضو '
            'تیم ایزوله‌ای ریویو تعلق نمی‌گیره.\n\n'
            '۵- دستور /reject اضافه شده و فقط توسط ریویوئرهایی قابل استفاده‌ست که سرشون شلوغ باشه یا عضو تیم ایزوله '
            'باشن. با این دستور خودتون رو از ریویوئرهای یک پی‌آر حذف می‌کنین و صاحب پی‌آر باید ریویوئر جدید انتخاب کنه.\n\n'
            '۶- چندتا باگ ریز برطرف شدن.\n\n'
            'برای اطلاعات بیشتر اینجا یا داخل خود بات می‌تونین دستور /help رو ببینین.\n\n'
            'Happy coding and reviewing!🎉🎉'
        )
    }
}
