# ---------------------------------- #
# Constants for command messages
# ---------------------------------- #

START_COMMAND_MESSAGE = 'سلام! به سامانه‌ی برنامه‌ریزی پی‌آر (سبپا) خوش اومدی. برای دریافت لیست کامندها دستور /help ' \
                        'رو اجرا کن. چی کار می‌تونم برات بکنم؟'


HELP_COMMAND_MESSAGE = """سلام! به سامانه ی برنامه ریزی پی‌آر خوش اومدی. ما هنوز به گیت‌هاب وصل نیستیم و این بات صرفا برای برنامه‌ریزی بهتر پی‌آرهامون ساخته شده. این لیست کامندها و نحوه‌ی استفاده ازشونه:

---------- 
کامند /addteam: برای اضافه کردن چندین تیم. این کامند فلگ‌های اجباری اسم -n و اعضا رو -m داره. فلگ تایپ گروه -t هم اختیاریه و می‌تونه general یا isolated باشه. می‌تونین هم‌زمان چندتا تیم رو با ; جدا و اضافه کنین. گروهی که جنرال باشه همه می‌تونن بهشون درخواست ریویو بدن ولی به اعضای تیم‌های isolated فقط خود هم‌تیمی‌هاشون می‌تونن درخواست بدن.

نمونه: /addteam@SabpaBot -n group name -t isoalted|general -m @member1 member1_first_name member1_last_name @member2 member2_first_name ; -n group2 -t general -m @member2 name_doesn't_matter_now @member3 new_user_first_name

---------- 
کامند /team: برای گرفتن اطلاعات یه تیم می‌تونی از این دستور استفاده کنی. در این دستور فلگ -t اسم گروه رو مشخص می‌کنه و اجباریه.

نمونه:
/team@SabpaBot -t group_name

----------
کامند /teams: برای گرفتن لیست تیم های گروه از این دستور استفاده کن. فلگی هم لازم نداره

نمونه:
/teams@SabpaBot

---------- 
کامند /review: با این کامند می‌تونین درخواست ریویو بدین. فلگ پول‌ریکوئست با -p و فلگ -t که اسم گروه رو مشخص می‌کنه اجباری هستن. با فلگ اختیاری -s می‌تونی وضعیت پول‌ریکوئستت رو مشخص کنی که normal هست یا urgent یا critical. برای مشخص کردن ریویوئر اول از -r و برای مشخص کردن ریویوئر دوم از -a استفاده کن. بعد از این فلگ‌ها یا باید آی‌دی تلگرام فردی رو بزنی یا مقدار random رو بزن که خود بات برات از یه نفر درخواست ریویو کنه. با فلگ -c هم اول تعداد خط‌های اضافه‌شده و بعد تعداد خط‌های کم‌شده رو بگو.

نمونه: /review@SabpaBot -p pr_number -t team_name -s normal|urgent|critical -r first_reviewer_id|random -a second_reviewer_id|random -c 150 50

---------- 
کامند /accept: برای قبول درخواست ریویویی که اومده سمتتون می‌تونین از این کامند استفاده کنین. با فلگ اجباری -p شماره‌ی پول‌ریکوئست رو مشخص کنین.

نمونه:
/accept@SabpaBot -p pr_number

---------- 
کامند /finish: برای اعلام پایان ریویویی که اومده سمتتون می‌تونین از این کامند استفاده کنین. با فلگ اجباری -p شماره‌ی پول‌ریکوئست رو مشخص کنین.

نمونه:
/finish@SabpaBot -p pr_number
"""